In [53]:
from selenium import webdriver

In [54]:
from selenium.webdriver.common.by import By
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [55]:
driver = webdriver.Chrome(r'C:\Users\shail\Downloads\chromedriver_win32\chromedriver.exe')

In [56]:
url = 'https://www.ambitionbox.com/'
driver.get(url)

In [57]:
sal = driver.find_element(By.XPATH,"/html/body/div[1]/nav/nav/a[4]")

In [58]:
sal.click()

In [59]:
search_job = driver.find_element(By.XPATH,"/html/body/div/div/div/main/section[1]/div[2]/div[1]/span/input")
search_job

In [60]:
search_job.send_keys("Data Scientist")

In [63]:
company = []

name = driver.find_elements(By.XPATH,'//div[@class="company-info"]')

for i in name[0:10]:
    company.append(i.text)

In [64]:
company

['Walmart\nData Scientist Salary\n3 yrs experience (based on 12 salaries)',
 'Ab Inbev\nData Scientist Salary\n3-4 yrs experience (based on 33 salaries)',
 'ZS\nData Scientist Salary\n2 yrs experience (based on 15 salaries)',
 'Optum\nData Scientist Salary\n3-4 yrs experience (based on 32 salaries)',
 'Reliance Jio\nData Scientist Salary\n3-4 yrs experience (based on 21 salaries)',
 'Fractal Analytics\nData Scientist Salary\n2-4 yrs experience (based on 89 salaries)',
 'Tiger Analytics\nData Scientist Salary\n2-4 yrs experience (based on 51 salaries)',
 'UnitedHealth\nData Scientist Salary\n2-4 yrs experience (based on 57 salaries)',
 'EXL Service\nData Scientist Salary\n3-4 yrs experience (based on 21 salaries)',
 'Deloitte\nData Scientist Salary\n2-4 yrs experience (based on 69 salaries)']

In [65]:
sal = []

salary = driver.find_elements(By.XPATH,'//div[@class="value body-medium"]')

for i in salary:
    sal.append(i.text)

In [66]:
len(sal)

20

In [67]:
min_sal = sal[0::2]

In [68]:
min_sal

['₹ 25.0L',
 '₹ 15.0L',
 '₹ 11.0L',
 '₹ 11.0L',
 '₹ 5.6L',
 '₹ 10.0L',
 '₹ 9.0L',
 '₹ 8.3L',
 '₹ 7.6L',
 '₹ 7.0L']

In [69]:
max_sal = sal[1::2]

In [70]:
max_sal

['₹ 36.0L',
 '₹ 26.2L',
 '₹ 22.0L',
 '₹ 22.5L',
 '₹ 26.2L',
 '₹ 23.0L',
 '₹ 20.0L',
 '₹ 21.1L',
 '₹ 21.0L',
 '₹ 25.0L']

In [71]:
avg = []

salary = driver.find_elements(By.XPATH,'//p[@class="averageCtc"]')

for i in salary:
    avg.append(i.text)

In [72]:
avg

['₹ 30.6L',
 '₹ 20.8L',
 '₹ 16.7L',
 '₹ 15.9L',
 '₹ 15.7L',
 '₹ 15.5L',
 '₹ 14.8L',
 '₹ 14.0L',
 '₹ 13.2L',
 '₹ 12.8L']

In [73]:
df = pd.DataFrame({'Company':company,'Min Salary':min_sal,'Max Sal':max_sal,'Avg Sal':avg})
df

,Company,Min Salary,Max Sal,Avg Sal
0,Walmart\nData Scientist Salary\n3 yrs experien...,₹ 25.0L,₹ 36.0L,₹ 30.6L
1,Ab Inbev\nData Scientist Salary\n3-4 yrs exper...,₹ 15.0L,₹ 26.2L,₹ 20.8L
2,ZS\nData Scientist Salary\n2 yrs experience (b...,₹ 11.0L,₹ 22.0L,₹ 16.7L
3,Optum\nData Scientist Salary\n3-4 yrs experien...,₹ 11.0L,₹ 22.5L,₹ 15.9L
4,Reliance Jio\nData Scientist Salary\n3-4 yrs e...,₹ 5.6L,₹ 26.2L,₹ 15.7L
5,Fractal Analytics\nData Scientist Salary\n2-4 ...,₹ 10.0L,₹ 23.0L,₹ 15.5L
6,Tiger Analytics\nData Scientist Salary\n2-4 yr...,₹ 9.0L,₹ 20.0L,₹ 14.8L
7,UnitedHealth\nData Scientist Salary\n2-4 yrs e...,₹ 8.3L,₹ 21.1L,₹ 14.0L
8,EXL Service\nData Scientist Salary\n3-4 yrs ex...,₹ 7.6L,₹ 21.0L,₹ 13.2L
9,Deloitte\nData Scientist Salary\n2-4 yrs exper...,₹ 7.0L,₹ 25.0L,₹ 12.8L

In [74]:
s = df['Company'].str.split(pat='\n',expand=True)
s

,0,1,2
0,Walmart,Data Scientist Salary,3 yrs experience (based on 12 salaries)
1,Ab Inbev,Data Scientist Salary,3-4 yrs experience (based on 33 salaries)
2,ZS,Data Scientist Salary,2 yrs experience (based on 15 salaries)
3,Optum,Data Scientist Salary,3-4 yrs experience (based on 32 salaries)
4,Reliance Jio,Data Scientist Salary,3-4 yrs experience (based on 21 salaries)
5,Fractal Analytics,Data Scientist Salary,2-4 yrs experience (based on 89 salaries)
6,Tiger Analytics,Data Scientist Salary,2-4 yrs experience (based on 51 salaries)
7,UnitedHealth,Data Scientist Salary,2-4 yrs experience (based on 57 salaries)
8,EXL Service,Data Scientist Salary,3-4 yrs experience (based on 21 salaries)
9,Deloitte,Data Scientist Salary,2-4 yrs experience (based on 69 salaries)

In [83]:
z = s[2].str[-12:-9]

In [84]:
z

0    12
1    33
2    15
3    32
4    21
5    89
6    51
7    57
8    21
9    69
Name: 2, dtype: object

In [91]:
E = s[2].str[:-37]

In [92]:
E

0      3
1    3-4
2      2
3    3-4
4    3-4
5    2-4
6    2-4
7    2-4
8    3-4
9    2-4
Name: 2, dtype: object

In [85]:
df['Salary Record'] = z

In [93]:
df['Exp'] = E

In [94]:
df['Company'] = s[0]

In [95]:
df

             Company Min Salary  Max Sal  Avg Sal Salary Record   Exp
0            Walmart    ₹ 25.0L  ₹ 36.0L  ₹ 30.6L           12     3
1           Ab Inbev    ₹ 15.0L  ₹ 26.2L  ₹ 20.8L           33   3-4
2                 ZS    ₹ 11.0L  ₹ 22.0L  ₹ 16.7L           15     2
3              Optum    ₹ 11.0L  ₹ 22.5L  ₹ 15.9L           32   3-4
4       Reliance Jio     ₹ 5.6L  ₹ 26.2L  ₹ 15.7L           21   3-4
5  Fractal Analytics    ₹ 10.0L  ₹ 23.0L  ₹ 15.5L           89   2-4
6    Tiger Analytics     ₹ 9.0L  ₹ 20.0L  ₹ 14.8L           51   2-4
7       UnitedHealth     ₹ 8.3L  ₹ 21.1L  ₹ 14.0L           57   2-4
8        EXL Service     ₹ 7.6L  ₹ 21.0L  ₹ 13.2L           21   3-4
9           Deloitte     ₹ 7.0L  ₹ 25.0L  ₹ 12.8L           69   2-4